app/controllers/api/v1/games_controller.rb

    def index
        @games = Game.all
---
SELECT "user_games".* FROM "user_games" WHERE "user_games"."game_id" = $1  [["game_id", 1]]

    def create
        @game = Game.create(game_params)
---
INSERT INTO "games" ("canvas", "created_at", "updated_at", "word", "current_guesser") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def update
        if @game.update(game_params.valid?)
---
UPDATE "games" SET "canvas" = $1, "word" = $2, "win_streak" = $3, "artist_id" = $4, "updated_at" = $5 WHERE "games"."id" = $6  [["canvas", ""], ["word", ""], ["win_streak", 1], ["artist_id", 1], ["updated_at", "2018-12-04 21:42:44.042440"], ["id", 1]]

    def destroy
        @game = Game.find(params[:id])
---
SELECT "user_games".* FROM "user_games" WHERE "user_games"."game_id" = $1  [["game_id", 1]]