app/controllers/api/v1/guest_games_controller.rb

SELECT "guest_games".* FROM "guest_games"
---
    def index
        @guest_games = GuestGame.all

INSERT INTO "guest_games" ("canvas", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?)
---
    def create
        @guest_game = GuestGame.create(guest_game_params)