app/controllers/api/v1/users_controller.rb

    def login
      @user = User.find_by(params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "abc"], ["LIMIT", 1]]

    def create
        @user = User.create(user_params)
---
INSERT INTO "users" ("username", "password_digest", "first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"