app/controllers/api/v1/user_games_controller.rb

    def index
        @user_games = UserGame.all
---
SELECT "user_games".* FROM "user_games"

    def show
        @user_game = UserGame.find(params[:id])
---
SELECT  "user_games".* FROM "user_games" WHERE "user_games"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def create
        @user_game = UserGame.create(user_game_params)
---
INSERT INTO "user_games" ("user_id", "game_id", "artist", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["game_id", 1], ["artist", false], ["created_at", "2018-12-04 11:21:06.775083"], ["updated_at", "2018-12-04 11:21:06.775083"]]

    def update
        @user_game = UserGame.find(params[:id])
        if @user_game
            @user_game.update(user_game_params)
---
SELECT  "user_games".* FROM "user_games" WHERE "user_games"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "user_games" SET "artist" = $1, "updated_at" = $2 WHERE "user_games"."id" = $3  [["artist", true], ["updated_at", "2018-12-04 13:35:18.007994"], ["id", 4]]