app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def get_current_user
    id = decoded_token['id']
    User.find_by(id: id)